let NewDate = ago(360m);
let DomainName = "example.com";
AzureActivity
| where TimeGenerated > NewDate
| where Authorization contains "Microsoft.Authorization/roleAssignments/write"
| where ActivityStatusValue == "Success"
| where Caller !contains DomainName
| where parse_json(Properties).activitySubstatusValue == "Created"
